{"id":27,"date":"2022-01-17T14:03:31","date_gmt":"2022-01-17T13:03:31","guid":{"rendered":"https:\/\/airdetails.com\/?page_id=27"},"modified":"2022-01-17T14:12:00","modified_gmt":"2022-01-17T13:12:00","slug":"bio","status":"publish","type":"page","link":"https:\/\/airdetails.com\/bio\/","title":{"rendered":"Bio"},"content":{"rendered":"<p>[vc_row][vc_column][vc_column_text]<\/p>\n<h2>Bio<\/h2>\n<p>[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;30&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221; style=&#8221;vc_box_rounded&#8221; onclick=&#8221;custom_link&#8221; img_link_target=&#8221;_blank&#8221; link=&#8221;instagram.com\/miguelgargallo.es&#8221;][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_column_text]Miguel Gargallo is the CEO of Pencil and serves on its board of directors.<\/p>\n<p>Before founding Pencil in October 2017, Miguel was Bolt Devs’s chief operating officer and was responsible for all of the club’s worldwide sales and services, including end-to-end management of Bolt equipment chain, sales activities, including service and support in all businesses and countries. He also headed Bolt’s RedPhone division and performed a key role in the advanced development of strategic and supplier relationships, ensuring flexibility in response to a frequently demanding marketplace.<\/p>\n<p>Before joining Pencil, Miguel was the photographer of over matches at FC Barcelona around the world for FC Barcelona Club and was responsible for procuring and managing photography inventory at collaboration at some corporate events as official Press Independent of the club.<\/p>\n<p>Previous to his work at FC Barcelona, Miguel was a key collaborator photographer for a month at Tesla Motors at La Illa Diagonal of the Testa Model X Event Expo. Also, he was accredited as a Mobile World Congress Official Press Photographer event, rewarded with a free full-event Pass, recognized alone by their portfolio.<\/p>\n<p>Miguel also spent eight years as an entrepreneur and two at La Manzana Mordida (Apple5x1), most recently as writer and designer of YouTube and Blo Entertainment. In addition, he led blog and branding functions for LAMM in Europe, Spain.<\/p>\n<p>Miguel earned 2 Bachelor of Business Administration degrees and Digital Marketing and Online Communication from Universitat Politecnica de Catalunya, where he was five years on both courses.[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column][vc_separator color=&#8221;white&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h2>Letter from the CEO<\/h2>\n<p>[\/vc_column_text][vc_column_text]I had a clear passion for photography from a very young age. I studied videography and later photography. I studied to be an entrepreneur and marketing expert. It wasn’t until I was 22 years old that I decided to leave other projects and focus on my startup and photography journey. During my studies I continued taking photos and presenting my work to several competitions at GuruShots and in the future in exhibitions.<\/p>\n<p>Motorsposrt photography at Tesla Motors, as I understood it at that time really fit me. It wasn’t a very strict and low risk kind of photography, the standards were not too conventional and bending the rules wasn’t almost impossible. Even though my first impressions were too positive there was still something about them that really caught my eye and convinced me that I could do something different with a little bit more of risk.<\/p>\n<p>During my experience being a photographer I learned that I must be different to really shot epic photos. Be different.<\/p>\n<p>I consider myself as an enthusiast and outgoing guy, sharing my time with others is very important to me.com 80% of my life is social and photography time, because I love to travel, but I also like to lie on a beach and watch the clouds with my music on my AirPods. I feel very fortunate to be doing what I love for a living.<\/p>\n<p>One more thing, Air Details LLC is the official commercial name of Pencil Works LLC, Pencil Works LLC and Air Details LLC are the same company.<\/p>\n<p>Thanks for visiting my site,<br \/>\nI know your time is important.<br \/>\nMiguel[\/vc_column_text][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"[vc_row][vc_column][vc_column_text] Bio [\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;30&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221; style=&#8221;vc_box_rounded&#8221; onclick=&#8221;custom_link&#8221; img_link_target=&#8221;_blank&#8221; link=&#8221;instagram.com\/miguelgargallo.es&#8221;][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_column_text]Miguel Gargallo is the CEO of Pencil&hellip;\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"csco_singular_sidebar":"","csco_page_header_type":"","csco_appearance_grid":"","csco_page_load_nextpost":"","csco_post_video_location":[],"csco_post_video_location_hash":"","csco_post_video_url":"","csco_post_video_bg_start_time":0,"csco_post_video_bg_end_time":0},"acf":[],"_links":{"self":[{"href":"https:\/\/airdetails.com\/wp-json\/wp\/v2\/pages\/27"}],"collection":[{"href":"https:\/\/airdetails.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/airdetails.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/airdetails.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/airdetails.com\/wp-json\/wp\/v2\/comments?post=27"}],"version-history":[{"count":1,"href":"https:\/\/airdetails.com\/wp-json\/wp\/v2\/pages\/27\/revisions"}],"predecessor-version":[{"id":32,"href":"https:\/\/airdetails.com\/wp-json\/wp\/v2\/pages\/27\/revisions\/32"}],"wp:attachment":[{"href":"https:\/\/airdetails.com\/wp-json\/wp\/v2\/media?parent=27"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}